/*******************************************************/
/*                                                     */
/*            Theory of Programming Languages          */
/*******************************************************/
/*                                                     */
/*                  HomeWork1                          */
/*               C programming  on lINUX               */
/*               dead line: 03 April (wed)             */
/*******************************************************/
/*  Programming Copyright & Environment:               */
/*                                                     */
/*         작성자 :김준성                              */
/*         작성날짜: 2019.04.01.                       */
/*******************************************************/

/*******************************************************/
/*               Included Header File                 */
/*******************************************************/ 
#include<stdio.h>
/*******************************************************/


/******************************************************/
/* 과제의 factorial 과정을 보여줄factorial_trace 함수 */
/******************************************************/ 
int factorial_trace(int n)
{	
	if(n==0)//n=0일때 1을 반환하며 함수를 종료합니다  
	{
		return 1;	
	}	
	else
	{
		return n*factorial_trace(n-1);//n=0이 함수의종료인데 그전까지 n을 줄여가며 recursion식으로 호출합니다
		//제일 작은수를 n==0으로두었고 이제 나머지는 recursion fairy라고 불리우는것이 해결해줍니다.			
	}
}
/********************************************************/
/*              main() Function                         */
/********************************************************/
int main()
{
	int i,j;
	int n;
	printf("factorial 과정을 추적할 값을 입력해주세요");//처음에는 과제에내어주신 3만을위한 프로그램을 만들었었는데
	// 입력값에따라서 변화할수있게끔 프로그래밍 하였습니다. 
	scanf("%d",&n);//factorial과정을 추적할 수를 입력해줍니다. 
	for(i=n; i>=0; i--)//탭 문자열과 추적과정을 보여주는데 도움을 줄  for문입니다 
	{
		for(j=i; j<n; j++)
		{
			printf("\t");//탭문자열을 점점점 하나씩 늘려갑니다  
		}
		printf("-> f(%d)\n",i);	//이 다음 for문과 비교하면 factorial trace과정을 잘알수있습니다.	
	}
	for(i=0; i<=n; i++)//이제 factorial 0부터 입력값까지 진행하며 값을 보이겠습니다. 
	{	
		for(j=i; j<n; j++)
		printf("\t");
		printf("<- f(%d)= %d\n",i,factorial_trace(i));//factorial trace과정을 보여줍니다.		
	}	
}
